tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/command-not-found"

# Terminal & Shell

cask "iterm2"
brew "zsh"
brew "zsh-syntax-highlighting"

# Miscellaneous

brew "coreutils"
brew "git"                                          # latest git
brew "gnu-typist"                                   # gtypist
brew "httpie"                                       # http: better curl
brew "unrar"                                        # unrar. augmented `extract` omz plugin.
brew "fd"                                           # fd: better find
brew "tldr"                                         # tldr: better man
brew "hr"                                           # hr: print linebreak
brew "terminal-notifier"                            # notify from terminal. see alias: notify
brew "direnv"                                       # direnv: manage project specific envs

# Core Programs

cask "firefox"
cask "google-chrome"
cask "telegram"

cask "cleanmymac"

cask "google-backup-and-sync"
cask "google-drive-file-stream"

# Fun Stuff

cask "steam"
cask "discord"
cask "teamspeak-client"
cask "battle-net"

# Arcanery

brew "mit-scheme"

# Development

brew "giter8"                                       # g8: seed new project from template

# cask "intellij-idea-ce"                           # idea ce: latest version will fucked up your development 
cask "visual-studio-code"                           # code
cask "lens"					    # lens: IDE for k8s
cask "zeplin"					    # collaborate tools for UX/UI designers

cask "paw"                                          # API tool

tap "adoptopenjdk/openjdk"
cask "adoptopenjdk"                                 # adoptopenjdk: latest (14 as of writing)
cask "adoptopenjdk8"                                # adoptopenjdk: 8, for scala 2.x.x development
brew "jenv"                                         # jenv: manage java version
brew "scala"                                        # scala, scalac
brew "sbt"                                          # sbt: slowest build tool

brew "node"                                         # node: nodejs runtime
brew "nvm"                                          # nvm: node version manager
brew "yarn"                                         # yarn: alt node package manager

brew "postgresql", restart_service: true            # postgres, psql: latest (12.2 as of writing)
brew "postgresql@9.6", restart_service: true        # postgres, psql: 9.6 (for legacy development)
cask "tableplus"                                    # DB management tool
cask "pgadmin4"                                     # DB Admin tool

brew "memcached"                                    # memcached: caching system

cask "google-cloud-sdk"                             # gcloud: for Google Cloud Platform development
cask "docker"                                       # container development platform. include kubectl
brew "helm"                                         # Kubernetes Package Manager

